---
kind: property
id: P:Autodesk.Revit.DB.PolylineSegments.IsFilled
source: html/8a3ae9ab-747c-4e7f-bc4b-a60e6f0b94e1.htm
---
# Autodesk.Revit.DB.PolylineSegments.IsFilled Property

Indicates whether the area enclosed by the polyline is to be filled or not.

## Syntax (C#)
```csharp
public bool IsFilled { get; }
```